{"name": "chess_model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 14, 10, 9], "sparse": false}, "inbound_nodes": []}, {"name": "input_conv-5-256", "class_name": "Conv2D", "config": {"name": "input_conv-5-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [5, 5]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "input_batchnorm", "class_name": "BatchNormalization", "config": {"name": "input_batchnorm", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["input_conv-5-256", 0, 0, {}]]]}, {"name": "input_relu", "class_name": "Activation", "config": {"name": "input_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["input_batchnorm", 0, 0, {}]]]}, {"name": "res1_conv1-3-256", "class_name": "Conv2D", "config": {"name": "res1_conv1-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_relu", 0, 0, {}]]]}, {"name": "res1_batchnorm1", "class_name": "BatchNormalization", "config": {"name": "res1_batchnorm1", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res1_conv1-3-256", 0, 0, {}]]]}, {"name": "res1_relu1", "class_name": "Activation", "config": {"name": "res1_relu1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res1_batchnorm1", 0, 0, {}]]]}, {"name": "res1_conv2-3-256", "class_name": "Conv2D", "config": {"name": "res1_conv2-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res1_relu1", 0, 0, {}]]]}, {"name": "res1_batchnorm2", "class_name": "BatchNormalization", "config": {"name": "res1_batchnorm2", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res1_conv2-3-256", 0, 0, {}]]]}, {"name": "res1_add", "class_name": "Add", "config": {"name": "res1_add", "trainable": true}, "inbound_nodes": [[["input_relu", 0, 0, {}], ["res1_batchnorm2", 0, 0, {}]]]}, {"name": "res1_relu2", "class_name": "Activation", "config": {"name": "res1_relu2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res1_add", 0, 0, {}]]]}, {"name": "res2_conv1-3-256", "class_name": "Conv2D", "config": {"name": "res2_conv1-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res1_relu2", 0, 0, {}]]]}, {"name": "res2_batchnorm1", "class_name": "BatchNormalization", "config": {"name": "res2_batchnorm1", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res2_conv1-3-256", 0, 0, {}]]]}, {"name": "res2_relu1", "class_name": "Activation", "config": {"name": "res2_relu1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res2_batchnorm1", 0, 0, {}]]]}, {"name": "res2_conv2-3-256", "class_name": "Conv2D", "config": {"name": "res2_conv2-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res2_relu1", 0, 0, {}]]]}, {"name": "res2_batchnorm2", "class_name": "BatchNormalization", "config": {"name": "res2_batchnorm2", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res2_conv2-3-256", 0, 0, {}]]]}, {"name": "res2_add", "class_name": "Add", "config": {"name": "res2_add", "trainable": true}, "inbound_nodes": [[["res1_relu2", 0, 0, {}], ["res2_batchnorm2", 0, 0, {}]]]}, {"name": "res2_relu2", "class_name": "Activation", "config": {"name": "res2_relu2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res2_add", 0, 0, {}]]]}, {"name": "res3_conv1-3-256", "class_name": "Conv2D", "config": {"name": "res3_conv1-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res2_relu2", 0, 0, {}]]]}, {"name": "res3_batchnorm1", "class_name": "BatchNormalization", "config": {"name": "res3_batchnorm1", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res3_conv1-3-256", 0, 0, {}]]]}, {"name": "res3_relu1", "class_name": "Activation", "config": {"name": "res3_relu1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res3_batchnorm1", 0, 0, {}]]]}, {"name": "res3_conv2-3-256", "class_name": "Conv2D", "config": {"name": "res3_conv2-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res3_relu1", 0, 0, {}]]]}, {"name": "res3_batchnorm2", "class_name": "BatchNormalization", "config": {"name": "res3_batchnorm2", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res3_conv2-3-256", 0, 0, {}]]]}, {"name": "res3_add", "class_name": "Add", "config": {"name": "res3_add", "trainable": true}, "inbound_nodes": [[["res2_relu2", 0, 0, {}], ["res3_batchnorm2", 0, 0, {}]]]}, {"name": "res3_relu2", "class_name": "Activation", "config": {"name": "res3_relu2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res3_add", 0, 0, {}]]]}, {"name": "res4_conv1-3-256", "class_name": "Conv2D", "config": {"name": "res4_conv1-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res3_relu2", 0, 0, {}]]]}, {"name": "res4_batchnorm1", "class_name": "BatchNormalization", "config": {"name": "res4_batchnorm1", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res4_conv1-3-256", 0, 0, {}]]]}, {"name": "res4_relu1", "class_name": "Activation", "config": {"name": "res4_relu1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res4_batchnorm1", 0, 0, {}]]]}, {"name": "res4_conv2-3-256", "class_name": "Conv2D", "config": {"name": "res4_conv2-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res4_relu1", 0, 0, {}]]]}, {"name": "res4_batchnorm2", "class_name": "BatchNormalization", "config": {"name": "res4_batchnorm2", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res4_conv2-3-256", 0, 0, {}]]]}, {"name": "res4_add", "class_name": "Add", "config": {"name": "res4_add", "trainable": true}, "inbound_nodes": [[["res3_relu2", 0, 0, {}], ["res4_batchnorm2", 0, 0, {}]]]}, {"name": "res4_relu2", "class_name": "Activation", "config": {"name": "res4_relu2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res4_add", 0, 0, {}]]]}, {"name": "res5_conv1-3-256", "class_name": "Conv2D", "config": {"name": "res5_conv1-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res4_relu2", 0, 0, {}]]]}, {"name": "res5_batchnorm1", "class_name": "BatchNormalization", "config": {"name": "res5_batchnorm1", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res5_conv1-3-256", 0, 0, {}]]]}, {"name": "res5_relu1", "class_name": "Activation", "config": {"name": "res5_relu1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res5_batchnorm1", 0, 0, {}]]]}, {"name": "res5_conv2-3-256", "class_name": "Conv2D", "config": {"name": "res5_conv2-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res5_relu1", 0, 0, {}]]]}, {"name": "res5_batchnorm2", "class_name": "BatchNormalization", "config": {"name": "res5_batchnorm2", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res5_conv2-3-256", 0, 0, {}]]]}, {"name": "res5_add", "class_name": "Add", "config": {"name": "res5_add", "trainable": true}, "inbound_nodes": [[["res4_relu2", 0, 0, {}], ["res5_batchnorm2", 0, 0, {}]]]}, {"name": "res5_relu2", "class_name": "Activation", "config": {"name": "res5_relu2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res5_add", 0, 0, {}]]]}, {"name": "res6_conv1-3-256", "class_name": "Conv2D", "config": {"name": "res6_conv1-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res5_relu2", 0, 0, {}]]]}, {"name": "res6_batchnorm1", "class_name": "BatchNormalization", "config": {"name": "res6_batchnorm1", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res6_conv1-3-256", 0, 0, {}]]]}, {"name": "res6_relu1", "class_name": "Activation", "config": {"name": "res6_relu1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res6_batchnorm1", 0, 0, {}]]]}, {"name": "res6_conv2-3-256", "class_name": "Conv2D", "config": {"name": "res6_conv2-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res6_relu1", 0, 0, {}]]]}, {"name": "res6_batchnorm2", "class_name": "BatchNormalization", "config": {"name": "res6_batchnorm2", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res6_conv2-3-256", 0, 0, {}]]]}, {"name": "res6_add", "class_name": "Add", "config": {"name": "res6_add", "trainable": true}, "inbound_nodes": [[["res5_relu2", 0, 0, {}], ["res6_batchnorm2", 0, 0, {}]]]}, {"name": "res6_relu2", "class_name": "Activation", "config": {"name": "res6_relu2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res6_add", 0, 0, {}]]]}, {"name": "res7_conv1-3-256", "class_name": "Conv2D", "config": {"name": "res7_conv1-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res6_relu2", 0, 0, {}]]]}, {"name": "res7_batchnorm1", "class_name": "BatchNormalization", "config": {"name": "res7_batchnorm1", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res7_conv1-3-256", 0, 0, {}]]]}, {"name": "res7_relu1", "class_name": "Activation", "config": {"name": "res7_relu1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res7_batchnorm1", 0, 0, {}]]]}, {"name": "res7_conv2-3-256", "class_name": "Conv2D", "config": {"name": "res7_conv2-3-256", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["res7_relu1", 0, 0, {}]]]}, {"name": "res7_batchnorm2", "class_name": "BatchNormalization", "config": {"name": "res7_batchnorm2", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["res7_conv2-3-256", 0, 0, {}]]]}, {"name": "res7_add", "class_name": "Add", "config": {"name": "res7_add", "trainable": true}, "inbound_nodes": [[["res6_relu2", 0, 0, {}], ["res7_batchnorm2", 0, 0, {}]]]}, {"name": "res7_relu2", "class_name": "Activation", "config": {"name": "res7_relu2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["res7_add", 0, 0, {}]]]}, {"name": "value_conv-1-4", "class_name": "Conv2D", "config": {"name": "value_conv-1-4", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 4, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [1, 1]}, "inbound_nodes": [[["res7_relu2", 0, 0, {}]]]}, {"name": "policy_conv-1-2", "class_name": "Conv2D", "config": {"name": "policy_conv-1-2", "use_bias": false, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 2, "strides": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "trainable": true, "kernel_size": [1, 1]}, "inbound_nodes": [[["res7_relu2", 0, 0, {}]]]}, {"name": "value_batchnorm", "class_name": "BatchNormalization", "config": {"name": "value_batchnorm", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["value_conv-1-4", 0, 0, {}]]]}, {"name": "policy_batchnorm", "class_name": "BatchNormalization", "config": {"name": "policy_batchnorm", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": 1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null}, "inbound_nodes": [[["policy_conv-1-2", 0, 0, {}]]]}, {"name": "value_relu", "class_name": "Activation", "config": {"name": "value_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["value_batchnorm", 0, 0, {}]]]}, {"name": "policy_relu", "class_name": "Activation", "config": {"name": "policy_relu", "activation": "relu", "trainable": true}, "inbound_nodes": [[["policy_batchnorm", 0, 0, {}]]]}, {"name": "value_flatten", "class_name": "Flatten", "config": {"name": "value_flatten", "trainable": true}, "inbound_nodes": [[["value_relu", 0, 0, {}]]]}, {"name": "policy_flatten", "class_name": "Flatten", "config": {"name": "policy_flatten", "trainable": true}, "inbound_nodes": [[["policy_relu", 0, 0, {}]]]}, {"name": "value_dense", "class_name": "Dense", "config": {"name": "value_dense", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "units": 256, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["value_flatten", 0, 0, {}]]]}, {"name": "policy_out", "class_name": "Dense", "config": {"name": "policy_out", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_regularizer": null, "units": 2086, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["policy_flatten", 0, 0, {}]]]}, {"name": "value_out", "class_name": "Dense", "config": {"name": "value_out", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_regularizer": null, "units": 1, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["value_dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]]}