{"name": "chess_model", "input_layers": [["input_1", 0, 0]], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 14, 10, 9], "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_conv-5-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "input_conv-5-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "input_batchnorm", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "input_batchnorm", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["input_conv-5-256", 0, 0, {}]]]}, {"name": "input_relu", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "input_relu"}, "inbound_nodes": [[["input_batchnorm", 0, 0, {}]]]}, {"name": "res1_conv1-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res1_conv1-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["input_relu", 0, 0, {}]]]}, {"name": "res1_batchnorm1", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res1_batchnorm1", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res1_conv1-3-256", 0, 0, {}]]]}, {"name": "res1_relu1", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res1_relu1"}, "inbound_nodes": [[["res1_batchnorm1", 0, 0, {}]]]}, {"name": "res1_conv2-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res1_conv2-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res1_relu1", 0, 0, {}]]]}, {"name": "res1_batchnorm2", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res1_batchnorm2", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res1_conv2-3-256", 0, 0, {}]]]}, {"name": "res1_add", "class_name": "Add", "config": {"trainable": true, "name": "res1_add"}, "inbound_nodes": [[["input_relu", 0, 0, {}], ["res1_batchnorm2", 0, 0, {}]]]}, {"name": "res1_relu2", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res1_relu2"}, "inbound_nodes": [[["res1_add", 0, 0, {}]]]}, {"name": "res2_conv1-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res2_conv1-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res1_relu2", 0, 0, {}]]]}, {"name": "res2_batchnorm1", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res2_batchnorm1", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res2_conv1-3-256", 0, 0, {}]]]}, {"name": "res2_relu1", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res2_relu1"}, "inbound_nodes": [[["res2_batchnorm1", 0, 0, {}]]]}, {"name": "res2_conv2-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res2_conv2-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res2_relu1", 0, 0, {}]]]}, {"name": "res2_batchnorm2", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res2_batchnorm2", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res2_conv2-3-256", 0, 0, {}]]]}, {"name": "res2_add", "class_name": "Add", "config": {"trainable": true, "name": "res2_add"}, "inbound_nodes": [[["res1_relu2", 0, 0, {}], ["res2_batchnorm2", 0, 0, {}]]]}, {"name": "res2_relu2", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res2_relu2"}, "inbound_nodes": [[["res2_add", 0, 0, {}]]]}, {"name": "res3_conv1-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res3_conv1-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res2_relu2", 0, 0, {}]]]}, {"name": "res3_batchnorm1", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res3_batchnorm1", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res3_conv1-3-256", 0, 0, {}]]]}, {"name": "res3_relu1", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res3_relu1"}, "inbound_nodes": [[["res3_batchnorm1", 0, 0, {}]]]}, {"name": "res3_conv2-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res3_conv2-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res3_relu1", 0, 0, {}]]]}, {"name": "res3_batchnorm2", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res3_batchnorm2", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res3_conv2-3-256", 0, 0, {}]]]}, {"name": "res3_add", "class_name": "Add", "config": {"trainable": true, "name": "res3_add"}, "inbound_nodes": [[["res2_relu2", 0, 0, {}], ["res3_batchnorm2", 0, 0, {}]]]}, {"name": "res3_relu2", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res3_relu2"}, "inbound_nodes": [[["res3_add", 0, 0, {}]]]}, {"name": "res4_conv1-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res4_conv1-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res3_relu2", 0, 0, {}]]]}, {"name": "res4_batchnorm1", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res4_batchnorm1", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res4_conv1-3-256", 0, 0, {}]]]}, {"name": "res4_relu1", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res4_relu1"}, "inbound_nodes": [[["res4_batchnorm1", 0, 0, {}]]]}, {"name": "res4_conv2-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res4_conv2-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res4_relu1", 0, 0, {}]]]}, {"name": "res4_batchnorm2", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res4_batchnorm2", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res4_conv2-3-256", 0, 0, {}]]]}, {"name": "res4_add", "class_name": "Add", "config": {"trainable": true, "name": "res4_add"}, "inbound_nodes": [[["res3_relu2", 0, 0, {}], ["res4_batchnorm2", 0, 0, {}]]]}, {"name": "res4_relu2", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res4_relu2"}, "inbound_nodes": [[["res4_add", 0, 0, {}]]]}, {"name": "res5_conv1-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res5_conv1-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res4_relu2", 0, 0, {}]]]}, {"name": "res5_batchnorm1", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res5_batchnorm1", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res5_conv1-3-256", 0, 0, {}]]]}, {"name": "res5_relu1", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res5_relu1"}, "inbound_nodes": [[["res5_batchnorm1", 0, 0, {}]]]}, {"name": "res5_conv2-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res5_conv2-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res5_relu1", 0, 0, {}]]]}, {"name": "res5_batchnorm2", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res5_batchnorm2", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res5_conv2-3-256", 0, 0, {}]]]}, {"name": "res5_add", "class_name": "Add", "config": {"trainable": true, "name": "res5_add"}, "inbound_nodes": [[["res4_relu2", 0, 0, {}], ["res5_batchnorm2", 0, 0, {}]]]}, {"name": "res5_relu2", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res5_relu2"}, "inbound_nodes": [[["res5_add", 0, 0, {}]]]}, {"name": "res6_conv1-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res6_conv1-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res5_relu2", 0, 0, {}]]]}, {"name": "res6_batchnorm1", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res6_batchnorm1", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res6_conv1-3-256", 0, 0, {}]]]}, {"name": "res6_relu1", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res6_relu1"}, "inbound_nodes": [[["res6_batchnorm1", 0, 0, {}]]]}, {"name": "res6_conv2-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res6_conv2-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res6_relu1", 0, 0, {}]]]}, {"name": "res6_batchnorm2", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res6_batchnorm2", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res6_conv2-3-256", 0, 0, {}]]]}, {"name": "res6_add", "class_name": "Add", "config": {"trainable": true, "name": "res6_add"}, "inbound_nodes": [[["res5_relu2", 0, 0, {}], ["res6_batchnorm2", 0, 0, {}]]]}, {"name": "res6_relu2", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res6_relu2"}, "inbound_nodes": [[["res6_add", 0, 0, {}]]]}, {"name": "res7_conv1-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res7_conv1-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res6_relu2", 0, 0, {}]]]}, {"name": "res7_batchnorm1", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res7_batchnorm1", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res7_conv1-3-256", 0, 0, {}]]]}, {"name": "res7_relu1", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res7_relu1"}, "inbound_nodes": [[["res7_batchnorm1", 0, 0, {}]]]}, {"name": "res7_conv2-3-256", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "res7_conv2-3-256", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res7_relu1", 0, 0, {}]]]}, {"name": "res7_batchnorm2", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "res7_batchnorm2", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["res7_conv2-3-256", 0, 0, {}]]]}, {"name": "res7_add", "class_name": "Add", "config": {"trainable": true, "name": "res7_add"}, "inbound_nodes": [[["res6_relu2", 0, 0, {}], ["res7_batchnorm2", 0, 0, {}]]]}, {"name": "res7_relu2", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "res7_relu2"}, "inbound_nodes": [[["res7_add", 0, 0, {}]]]}, {"name": "value_conv-1-4", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "value_conv-1-4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 4, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res7_relu2", 0, 0, {}]]]}, {"name": "policy_conv-1-2", "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "data_format": "channels_first", "name": "policy_conv-1-2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 2, "use_bias": false, "activation": "linear", "strides": [1, 1], "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["res7_relu2", 0, 0, {}]]]}, {"name": "value_batchnorm", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "value_batchnorm", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["value_conv-1-4", 0, 0, {}]]]}, {"name": "policy_batchnorm", "class_name": "BatchNormalization", "config": {"scale": true, "axis": 1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "name": "policy_batchnorm", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["policy_conv-1-2", 0, 0, {}]]]}, {"name": "value_relu", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "value_relu"}, "inbound_nodes": [[["value_batchnorm", 0, 0, {}]]]}, {"name": "policy_relu", "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "policy_relu"}, "inbound_nodes": [[["policy_batchnorm", 0, 0, {}]]]}, {"name": "value_flatten", "class_name": "Flatten", "config": {"trainable": true, "name": "value_flatten"}, "inbound_nodes": [[["value_relu", 0, 0, {}]]]}, {"name": "policy_flatten", "class_name": "Flatten", "config": {"trainable": true, "name": "policy_flatten"}, "inbound_nodes": [[["policy_relu", 0, 0, {}]]]}, {"name": "value_dense", "class_name": "Dense", "config": {"activity_regularizer": null, "units": 256, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "value_dense", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "activation": "relu", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["value_flatten", 0, 0, {}]]]}, {"name": "policy_out", "class_name": "Dense", "config": {"activity_regularizer": null, "units": 2086, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "policy_out", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["policy_flatten", 0, 0, {}]]]}, {"name": "value_out", "class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "value_out", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "activation": "tanh", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "inbound_nodes": [[["value_dense", 0, 0, {}]]]}]}