{"name": "chess_model", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 14, 10, 9], "dtype": "float32", "name": "input_1", "sparse": false}}, {"name": "input_conv-5-256", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "input_conv-5-256", "kernel_size": [5, 5], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "input_batchnorm", "class_name": "BatchNormalization", "inbound_nodes": [[["input_conv-5-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "input_batchnorm", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "input_relu", "class_name": "Activation", "inbound_nodes": [[["input_batchnorm", 0, 0, {}]]], "config": {"trainable": true, "name": "input_relu", "activation": "relu"}}, {"name": "res1_conv1-3-256", "class_name": "Conv2D", "inbound_nodes": [[["input_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res1_conv1-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res1_batchnorm1", "class_name": "BatchNormalization", "inbound_nodes": [[["res1_conv1-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res1_batchnorm1", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res1_relu1", "class_name": "Activation", "inbound_nodes": [[["res1_batchnorm1", 0, 0, {}]]], "config": {"trainable": true, "name": "res1_relu1", "activation": "relu"}}, {"name": "res1_conv2-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res1_relu1", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res1_conv2-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res1_batchnorm2", "class_name": "BatchNormalization", "inbound_nodes": [[["res1_conv2-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res1_batchnorm2", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res1_add", "class_name": "Add", "inbound_nodes": [[["input_relu", 0, 0, {}], ["res1_batchnorm2", 0, 0, {}]]], "config": {"trainable": true, "name": "res1_add"}}, {"name": "res1_relu2", "class_name": "Activation", "inbound_nodes": [[["res1_add", 0, 0, {}]]], "config": {"trainable": true, "name": "res1_relu2", "activation": "relu"}}, {"name": "res2_conv1-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res1_relu2", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res2_conv1-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res2_batchnorm1", "class_name": "BatchNormalization", "inbound_nodes": [[["res2_conv1-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res2_batchnorm1", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res2_relu1", "class_name": "Activation", "inbound_nodes": [[["res2_batchnorm1", 0, 0, {}]]], "config": {"trainable": true, "name": "res2_relu1", "activation": "relu"}}, {"name": "res2_conv2-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res2_relu1", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res2_conv2-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res2_batchnorm2", "class_name": "BatchNormalization", "inbound_nodes": [[["res2_conv2-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res2_batchnorm2", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res2_add", "class_name": "Add", "inbound_nodes": [[["res1_relu2", 0, 0, {}], ["res2_batchnorm2", 0, 0, {}]]], "config": {"trainable": true, "name": "res2_add"}}, {"name": "res2_relu2", "class_name": "Activation", "inbound_nodes": [[["res2_add", 0, 0, {}]]], "config": {"trainable": true, "name": "res2_relu2", "activation": "relu"}}, {"name": "res3_conv1-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res2_relu2", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res3_conv1-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res3_batchnorm1", "class_name": "BatchNormalization", "inbound_nodes": [[["res3_conv1-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res3_batchnorm1", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res3_relu1", "class_name": "Activation", "inbound_nodes": [[["res3_batchnorm1", 0, 0, {}]]], "config": {"trainable": true, "name": "res3_relu1", "activation": "relu"}}, {"name": "res3_conv2-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res3_relu1", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res3_conv2-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res3_batchnorm2", "class_name": "BatchNormalization", "inbound_nodes": [[["res3_conv2-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res3_batchnorm2", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res3_add", "class_name": "Add", "inbound_nodes": [[["res2_relu2", 0, 0, {}], ["res3_batchnorm2", 0, 0, {}]]], "config": {"trainable": true, "name": "res3_add"}}, {"name": "res3_relu2", "class_name": "Activation", "inbound_nodes": [[["res3_add", 0, 0, {}]]], "config": {"trainable": true, "name": "res3_relu2", "activation": "relu"}}, {"name": "res4_conv1-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res3_relu2", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res4_conv1-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res4_batchnorm1", "class_name": "BatchNormalization", "inbound_nodes": [[["res4_conv1-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res4_batchnorm1", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res4_relu1", "class_name": "Activation", "inbound_nodes": [[["res4_batchnorm1", 0, 0, {}]]], "config": {"trainable": true, "name": "res4_relu1", "activation": "relu"}}, {"name": "res4_conv2-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res4_relu1", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res4_conv2-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res4_batchnorm2", "class_name": "BatchNormalization", "inbound_nodes": [[["res4_conv2-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res4_batchnorm2", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res4_add", "class_name": "Add", "inbound_nodes": [[["res3_relu2", 0, 0, {}], ["res4_batchnorm2", 0, 0, {}]]], "config": {"trainable": true, "name": "res4_add"}}, {"name": "res4_relu2", "class_name": "Activation", "inbound_nodes": [[["res4_add", 0, 0, {}]]], "config": {"trainable": true, "name": "res4_relu2", "activation": "relu"}}, {"name": "res5_conv1-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res4_relu2", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res5_conv1-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res5_batchnorm1", "class_name": "BatchNormalization", "inbound_nodes": [[["res5_conv1-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res5_batchnorm1", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res5_relu1", "class_name": "Activation", "inbound_nodes": [[["res5_batchnorm1", 0, 0, {}]]], "config": {"trainable": true, "name": "res5_relu1", "activation": "relu"}}, {"name": "res5_conv2-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res5_relu1", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res5_conv2-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res5_batchnorm2", "class_name": "BatchNormalization", "inbound_nodes": [[["res5_conv2-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res5_batchnorm2", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res5_add", "class_name": "Add", "inbound_nodes": [[["res4_relu2", 0, 0, {}], ["res5_batchnorm2", 0, 0, {}]]], "config": {"trainable": true, "name": "res5_add"}}, {"name": "res5_relu2", "class_name": "Activation", "inbound_nodes": [[["res5_add", 0, 0, {}]]], "config": {"trainable": true, "name": "res5_relu2", "activation": "relu"}}, {"name": "res6_conv1-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res5_relu2", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res6_conv1-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res6_batchnorm1", "class_name": "BatchNormalization", "inbound_nodes": [[["res6_conv1-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res6_batchnorm1", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res6_relu1", "class_name": "Activation", "inbound_nodes": [[["res6_batchnorm1", 0, 0, {}]]], "config": {"trainable": true, "name": "res6_relu1", "activation": "relu"}}, {"name": "res6_conv2-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res6_relu1", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res6_conv2-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res6_batchnorm2", "class_name": "BatchNormalization", "inbound_nodes": [[["res6_conv2-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res6_batchnorm2", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res6_add", "class_name": "Add", "inbound_nodes": [[["res5_relu2", 0, 0, {}], ["res6_batchnorm2", 0, 0, {}]]], "config": {"trainable": true, "name": "res6_add"}}, {"name": "res6_relu2", "class_name": "Activation", "inbound_nodes": [[["res6_add", 0, 0, {}]]], "config": {"trainable": true, "name": "res6_relu2", "activation": "relu"}}, {"name": "res7_conv1-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res6_relu2", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res7_conv1-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res7_batchnorm1", "class_name": "BatchNormalization", "inbound_nodes": [[["res7_conv1-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res7_batchnorm1", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res7_relu1", "class_name": "Activation", "inbound_nodes": [[["res7_batchnorm1", 0, 0, {}]]], "config": {"trainable": true, "name": "res7_relu1", "activation": "relu"}}, {"name": "res7_conv2-3-256", "class_name": "Conv2D", "inbound_nodes": [[["res7_relu1", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "name": "res7_conv2-3-256", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "res7_batchnorm2", "class_name": "BatchNormalization", "inbound_nodes": [[["res7_conv2-3-256", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "res7_batchnorm2", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "res7_add", "class_name": "Add", "inbound_nodes": [[["res6_relu2", 0, 0, {}], ["res7_batchnorm2", 0, 0, {}]]], "config": {"trainable": true, "name": "res7_add"}}, {"name": "res7_relu2", "class_name": "Activation", "inbound_nodes": [[["res7_add", 0, 0, {}]]], "config": {"trainable": true, "name": "res7_relu2", "activation": "relu"}}, {"name": "value_conv-1-4", "class_name": "Conv2D", "inbound_nodes": [[["res7_relu2", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 4, "name": "value_conv-1-4", "kernel_size": [1, 1], "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "policy_conv-1-2", "class_name": "Conv2D", "inbound_nodes": [[["res7_relu2", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 2, "name": "policy_conv-1-2", "kernel_size": [1, 1], "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null}}, {"name": "value_batchnorm", "class_name": "BatchNormalization", "inbound_nodes": [[["value_conv-1-4", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "value_batchnorm", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "policy_batchnorm", "class_name": "BatchNormalization", "inbound_nodes": [[["policy_conv-1-2", 0, 0, {}]]], "config": {"beta_regularizer": null, "gamma_constraint": null, "name": "policy_batchnorm", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"name": "value_relu", "class_name": "Activation", "inbound_nodes": [[["value_batchnorm", 0, 0, {}]]], "config": {"trainable": true, "name": "value_relu", "activation": "relu"}}, {"name": "policy_relu", "class_name": "Activation", "inbound_nodes": [[["policy_batchnorm", 0, 0, {}]]], "config": {"trainable": true, "name": "policy_relu", "activation": "relu"}}, {"name": "value_flatten", "class_name": "Flatten", "inbound_nodes": [[["value_relu", 0, 0, {}]]], "config": {"trainable": true, "name": "value_flatten"}}, {"name": "policy_flatten", "class_name": "Flatten", "inbound_nodes": [[["policy_relu", 0, 0, {}]]], "config": {"trainable": true, "name": "policy_flatten"}}, {"name": "value_dense", "class_name": "Dense", "inbound_nodes": [[["value_flatten", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 256, "name": "value_dense"}}, {"name": "policy_out", "class_name": "Dense", "inbound_nodes": [[["policy_flatten", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 2086, "name": "policy_out"}}, {"name": "value_out", "class_name": "Dense", "inbound_nodes": [[["value_dense", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 1, "name": "value_out"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]]}