{"layers": [{"config": {"batch_input_shape": [null, 14, 10, 9], "dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [5, 5], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "input_conv-5-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "input_conv-5-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "input_batchnorm", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_conv-5-256", 0, 0, {}]]], "name": "input_batchnorm", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "input_relu"}, "inbound_nodes": [[["input_batchnorm", 0, 0, {}]]], "name": "input_relu", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res1_conv1-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["input_relu", 0, 0, {}]]], "name": "res1_conv1-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res1_batchnorm1", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res1_conv1-3-256", 0, 0, {}]]], "name": "res1_batchnorm1", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "res1_relu1"}, "inbound_nodes": [[["res1_batchnorm1", 0, 0, {}]]], "name": "res1_relu1", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res1_conv2-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res1_relu1", 0, 0, {}]]], "name": "res1_conv2-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res1_batchnorm2", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res1_conv2-3-256", 0, 0, {}]]], "name": "res1_batchnorm2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "res1_add"}, "inbound_nodes": [[["input_relu", 0, 0, {}], ["res1_batchnorm2", 0, 0, {}]]], "name": "res1_add", "class_name": "Add"}, {"config": {"activation": "relu", "trainable": true, "name": "res1_relu2"}, "inbound_nodes": [[["res1_add", 0, 0, {}]]], "name": "res1_relu2", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res2_conv1-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res1_relu2", 0, 0, {}]]], "name": "res2_conv1-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res2_batchnorm1", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res2_conv1-3-256", 0, 0, {}]]], "name": "res2_batchnorm1", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "res2_relu1"}, "inbound_nodes": [[["res2_batchnorm1", 0, 0, {}]]], "name": "res2_relu1", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res2_conv2-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res2_relu1", 0, 0, {}]]], "name": "res2_conv2-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res2_batchnorm2", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res2_conv2-3-256", 0, 0, {}]]], "name": "res2_batchnorm2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "res2_add"}, "inbound_nodes": [[["res1_relu2", 0, 0, {}], ["res2_batchnorm2", 0, 0, {}]]], "name": "res2_add", "class_name": "Add"}, {"config": {"activation": "relu", "trainable": true, "name": "res2_relu2"}, "inbound_nodes": [[["res2_add", 0, 0, {}]]], "name": "res2_relu2", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res3_conv1-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res2_relu2", 0, 0, {}]]], "name": "res3_conv1-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res3_batchnorm1", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res3_conv1-3-256", 0, 0, {}]]], "name": "res3_batchnorm1", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "res3_relu1"}, "inbound_nodes": [[["res3_batchnorm1", 0, 0, {}]]], "name": "res3_relu1", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res3_conv2-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res3_relu1", 0, 0, {}]]], "name": "res3_conv2-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res3_batchnorm2", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res3_conv2-3-256", 0, 0, {}]]], "name": "res3_batchnorm2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "res3_add"}, "inbound_nodes": [[["res2_relu2", 0, 0, {}], ["res3_batchnorm2", 0, 0, {}]]], "name": "res3_add", "class_name": "Add"}, {"config": {"activation": "relu", "trainable": true, "name": "res3_relu2"}, "inbound_nodes": [[["res3_add", 0, 0, {}]]], "name": "res3_relu2", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res4_conv1-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res3_relu2", 0, 0, {}]]], "name": "res4_conv1-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res4_batchnorm1", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res4_conv1-3-256", 0, 0, {}]]], "name": "res4_batchnorm1", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "res4_relu1"}, "inbound_nodes": [[["res4_batchnorm1", 0, 0, {}]]], "name": "res4_relu1", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res4_conv2-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res4_relu1", 0, 0, {}]]], "name": "res4_conv2-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res4_batchnorm2", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res4_conv2-3-256", 0, 0, {}]]], "name": "res4_batchnorm2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "res4_add"}, "inbound_nodes": [[["res3_relu2", 0, 0, {}], ["res4_batchnorm2", 0, 0, {}]]], "name": "res4_add", "class_name": "Add"}, {"config": {"activation": "relu", "trainable": true, "name": "res4_relu2"}, "inbound_nodes": [[["res4_add", 0, 0, {}]]], "name": "res4_relu2", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res5_conv1-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res4_relu2", 0, 0, {}]]], "name": "res5_conv1-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res5_batchnorm1", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res5_conv1-3-256", 0, 0, {}]]], "name": "res5_batchnorm1", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "res5_relu1"}, "inbound_nodes": [[["res5_batchnorm1", 0, 0, {}]]], "name": "res5_relu1", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res5_conv2-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res5_relu1", 0, 0, {}]]], "name": "res5_conv2-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res5_batchnorm2", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res5_conv2-3-256", 0, 0, {}]]], "name": "res5_batchnorm2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "res5_add"}, "inbound_nodes": [[["res4_relu2", 0, 0, {}], ["res5_batchnorm2", 0, 0, {}]]], "name": "res5_add", "class_name": "Add"}, {"config": {"activation": "relu", "trainable": true, "name": "res5_relu2"}, "inbound_nodes": [[["res5_add", 0, 0, {}]]], "name": "res5_relu2", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res6_conv1-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res5_relu2", 0, 0, {}]]], "name": "res6_conv1-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res6_batchnorm1", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res6_conv1-3-256", 0, 0, {}]]], "name": "res6_batchnorm1", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "res6_relu1"}, "inbound_nodes": [[["res6_batchnorm1", 0, 0, {}]]], "name": "res6_relu1", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res6_conv2-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res6_relu1", 0, 0, {}]]], "name": "res6_conv2-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res6_batchnorm2", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res6_conv2-3-256", 0, 0, {}]]], "name": "res6_batchnorm2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "res6_add"}, "inbound_nodes": [[["res5_relu2", 0, 0, {}], ["res6_batchnorm2", 0, 0, {}]]], "name": "res6_add", "class_name": "Add"}, {"config": {"activation": "relu", "trainable": true, "name": "res6_relu2"}, "inbound_nodes": [[["res6_add", 0, 0, {}]]], "name": "res6_relu2", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res7_conv1-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res6_relu2", 0, 0, {}]]], "name": "res7_conv1-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res7_batchnorm1", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res7_conv1-3-256", 0, 0, {}]]], "name": "res7_batchnorm1", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "res7_relu1"}, "inbound_nodes": [[["res7_batchnorm1", 0, 0, {}]]], "name": "res7_relu1", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "name": "res7_conv2-3-256", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 256}, "inbound_nodes": [[["res7_relu1", 0, 0, {}]]], "name": "res7_conv2-3-256", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "res7_batchnorm2", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["res7_conv2-3-256", 0, 0, {}]]], "name": "res7_batchnorm2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "res7_add"}, "inbound_nodes": [[["res6_relu2", 0, 0, {}], ["res7_batchnorm2", 0, 0, {}]]], "name": "res7_add", "class_name": "Add"}, {"config": {"activation": "relu", "trainable": true, "name": "res7_relu2"}, "inbound_nodes": [[["res7_add", 0, 0, {}]]], "name": "res7_relu2", "class_name": "Activation"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "name": "value_conv-1-4", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 4}, "inbound_nodes": [[["res7_relu2", 0, 0, {}]]], "name": "value_conv-1-4", "class_name": "Conv2D"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "name": "policy_conv-1-2", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_first", "filters": 2}, "inbound_nodes": [[["res7_relu2", 0, 0, {}]]], "name": "policy_conv-1-2", "class_name": "Conv2D"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "value_batchnorm", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["value_conv-1-4", 0, 0, {}]]], "name": "value_batchnorm", "class_name": "BatchNormalization"}, {"config": {"scale": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "axis": 1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "name": "policy_batchnorm", "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["policy_conv-1-2", 0, 0, {}]]], "name": "policy_batchnorm", "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "value_relu"}, "inbound_nodes": [[["value_batchnorm", 0, 0, {}]]], "name": "value_relu", "class_name": "Activation"}, {"config": {"activation": "relu", "trainable": true, "name": "policy_relu"}, "inbound_nodes": [[["policy_batchnorm", 0, 0, {}]]], "name": "policy_relu", "class_name": "Activation"}, {"config": {"trainable": true, "name": "value_flatten"}, "inbound_nodes": [[["value_relu", 0, 0, {}]]], "name": "value_flatten", "class_name": "Flatten"}, {"config": {"trainable": true, "name": "policy_flatten"}, "inbound_nodes": [[["policy_relu", 0, 0, {}]]], "name": "policy_flatten", "class_name": "Flatten"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "activation": "relu", "name": "value_dense", "units": 256, "bias_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["value_flatten", 0, 0, {}]]], "name": "value_dense", "class_name": "Dense"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "activation": "softmax", "name": "policy_out", "units": 2086, "bias_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["policy_flatten", 0, 0, {}]]], "name": "policy_out", "class_name": "Dense"}, {"config": {"kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "activation": "tanh", "name": "value_out", "units": 1, "bias_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["value_dense", 0, 0, {}]]], "name": "value_out", "class_name": "Dense"}], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]], "name": "chess_model", "input_layers": [["input_1", 0, 0]]}