{"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 14, 10, 9]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "input_conv-5-256", "config": {"name": "input_conv-5-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "input_batchnorm", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "input_batchnorm", "beta_constraint": null}, "inbound_nodes": [[["input_conv-5-256", 0, 0, {}]]]}, {"class_name": "Activation", "name": "input_relu", "config": {"name": "input_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["input_batchnorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res1_conv1-3-256", "config": {"name": "res1_conv1-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["input_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res1_batchnorm1", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res1_batchnorm1", "beta_constraint": null}, "inbound_nodes": [[["res1_conv1-3-256", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res1_relu1", "config": {"name": "res1_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res1_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res1_conv2-3-256", "config": {"name": "res1_conv2-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res1_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res1_batchnorm2", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res1_batchnorm2", "beta_constraint": null}, "inbound_nodes": [[["res1_conv2-3-256", 0, 0, {}]]]}, {"class_name": "Add", "name": "res1_add", "config": {"name": "res1_add", "trainable": true}, "inbound_nodes": [[["input_relu", 0, 0, {}], ["res1_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res1_relu2", "config": {"name": "res1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res1_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2_conv1-3-256", "config": {"name": "res2_conv1-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res1_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res2_batchnorm1", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res2_batchnorm1", "beta_constraint": null}, "inbound_nodes": [[["res2_conv1-3-256", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res2_relu1", "config": {"name": "res2_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res2_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2_conv2-3-256", "config": {"name": "res2_conv2-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res2_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res2_batchnorm2", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res2_batchnorm2", "beta_constraint": null}, "inbound_nodes": [[["res2_conv2-3-256", 0, 0, {}]]]}, {"class_name": "Add", "name": "res2_add", "config": {"name": "res2_add", "trainable": true}, "inbound_nodes": [[["res1_relu2", 0, 0, {}], ["res2_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res2_relu2", "config": {"name": "res2_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res2_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3_conv1-3-256", "config": {"name": "res3_conv1-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res2_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res3_batchnorm1", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res3_batchnorm1", "beta_constraint": null}, "inbound_nodes": [[["res3_conv1-3-256", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res3_relu1", "config": {"name": "res3_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res3_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3_conv2-3-256", "config": {"name": "res3_conv2-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res3_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res3_batchnorm2", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res3_batchnorm2", "beta_constraint": null}, "inbound_nodes": [[["res3_conv2-3-256", 0, 0, {}]]]}, {"class_name": "Add", "name": "res3_add", "config": {"name": "res3_add", "trainable": true}, "inbound_nodes": [[["res2_relu2", 0, 0, {}], ["res3_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res3_relu2", "config": {"name": "res3_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res3_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4_conv1-3-256", "config": {"name": "res4_conv1-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res3_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res4_batchnorm1", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res4_batchnorm1", "beta_constraint": null}, "inbound_nodes": [[["res4_conv1-3-256", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res4_relu1", "config": {"name": "res4_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res4_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4_conv2-3-256", "config": {"name": "res4_conv2-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res4_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res4_batchnorm2", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res4_batchnorm2", "beta_constraint": null}, "inbound_nodes": [[["res4_conv2-3-256", 0, 0, {}]]]}, {"class_name": "Add", "name": "res4_add", "config": {"name": "res4_add", "trainable": true}, "inbound_nodes": [[["res3_relu2", 0, 0, {}], ["res4_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res4_relu2", "config": {"name": "res4_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res4_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res5_conv1-3-256", "config": {"name": "res5_conv1-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res4_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res5_batchnorm1", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res5_batchnorm1", "beta_constraint": null}, "inbound_nodes": [[["res5_conv1-3-256", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res5_relu1", "config": {"name": "res5_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res5_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res5_conv2-3-256", "config": {"name": "res5_conv2-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res5_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res5_batchnorm2", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res5_batchnorm2", "beta_constraint": null}, "inbound_nodes": [[["res5_conv2-3-256", 0, 0, {}]]]}, {"class_name": "Add", "name": "res5_add", "config": {"name": "res5_add", "trainable": true}, "inbound_nodes": [[["res4_relu2", 0, 0, {}], ["res5_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res5_relu2", "config": {"name": "res5_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res5_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res6_conv1-3-256", "config": {"name": "res6_conv1-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res5_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res6_batchnorm1", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res6_batchnorm1", "beta_constraint": null}, "inbound_nodes": [[["res6_conv1-3-256", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res6_relu1", "config": {"name": "res6_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res6_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res6_conv2-3-256", "config": {"name": "res6_conv2-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res6_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res6_batchnorm2", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res6_batchnorm2", "beta_constraint": null}, "inbound_nodes": [[["res6_conv2-3-256", 0, 0, {}]]]}, {"class_name": "Add", "name": "res6_add", "config": {"name": "res6_add", "trainable": true}, "inbound_nodes": [[["res5_relu2", 0, 0, {}], ["res6_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res6_relu2", "config": {"name": "res6_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res6_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res7_conv1-3-256", "config": {"name": "res7_conv1-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res6_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res7_batchnorm1", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res7_batchnorm1", "beta_constraint": null}, "inbound_nodes": [[["res7_conv1-3-256", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res7_relu1", "config": {"name": "res7_relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res7_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res7_conv2-3-256", "config": {"name": "res7_conv2-3-256", "padding": "same", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res7_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "res7_batchnorm2", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "res7_batchnorm2", "beta_constraint": null}, "inbound_nodes": [[["res7_conv2-3-256", 0, 0, {}]]]}, {"class_name": "Add", "name": "res7_add", "config": {"name": "res7_add", "trainable": true}, "inbound_nodes": [[["res6_relu2", 0, 0, {}], ["res7_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "res7_relu2", "config": {"name": "res7_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res7_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "value_conv-1-4", "config": {"name": "value_conv-1-4", "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 4, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res7_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "policy_conv-1-2", "config": {"name": "policy_conv-1-2", "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 2, "trainable": true, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["res7_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "value_batchnorm", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "value_batchnorm", "beta_constraint": null}, "inbound_nodes": [[["value_conv-1-4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "policy_batchnorm", "config": {"gamma_constraint": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "name": "policy_batchnorm", "beta_constraint": null}, "inbound_nodes": [[["policy_conv-1-2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "value_relu", "config": {"name": "value_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["value_batchnorm", 0, 0, {}]]]}, {"class_name": "Activation", "name": "policy_relu", "config": {"name": "policy_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["policy_batchnorm", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "value_flatten", "config": {"name": "value_flatten", "trainable": true}, "inbound_nodes": [[["value_relu", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "policy_flatten", "config": {"name": "policy_flatten", "trainable": true}, "inbound_nodes": [[["policy_relu", 0, 0, {}]]]}, {"class_name": "Dense", "name": "value_dense", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "units": 256, "name": "value_dense"}, "inbound_nodes": [[["value_flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "policy_out", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "units": 2086, "name": "policy_out"}, "inbound_nodes": [[["policy_flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "value_out", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "use_bias": true, "units": 1, "name": "value_out"}, "inbound_nodes": [[["value_dense", 0, 0, {}]]]}], "name": "chess_model", "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]], "input_layers": [["input_1", 0, 0]]}